In [1]:
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0], 
                 index = ['a','b','c','d'])

In [2]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [6]:
print(data[0:2])
print(data[['a','b','c']])

a    0.25
b    0.50
dtype: float64
a    0.25
b    0.50
c    0.75
dtype: float64

In [8]:
area = pd.Series({'california': 423967, 'texas':695662, 'new york': 141297, 'Florida':170312,
                  'Illinois': 149995})
pop = pd.Series({'california': 38332521, 'texas':26448193, 'new york': 19651127, 'Florida':19552860,
                  'Illinois': 12882135})
data= pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
california  423967  38332521
texas       695662  26448193
new york    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [11]:
data['area'] # = data.area 해도 됨

california    423967
texas         695662
new york      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [13]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
california  423967  38332521   90.413926
texas       695662  26448193   38.018740
new york    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [15]:
data.values
data.T # trasnpose matrix

           california         texas      new york       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [20]:
data.iloc[:3,:2]

              area       pop
california  423967  38332521
texas       695662  26448193
new york    141297  19651127

In [21]:
data.loc[data.density > 100, ['pop','area']]

               pop    area
new york  19651127  141297
Florida   19552860  170312

In [24]:
import pandas as pd
import numpy as np

rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [26]:
df = pd.DataFrame(rng.randint(0, 10, (3,4)), columns=['A','B','C','D'])
df

   A  B  C  D
0  1  7  5  1
1  4  0  9  5
2  8  0  9  2

In [28]:
np.exp(ser)
np.sin(df*np.pi/4)

              A         B         C         D
0  7.071068e-01 -0.707107 -0.707107  0.707107
1  1.224647e-16  0.000000  0.707107 -0.707107
2 -2.449294e-16  0.000000  0.707107  1.000000

In [33]:
area = pd.Series({'Alaska': 172337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                  'New York': 19651127}, name='population')

population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [34]:
area.index | population.index

/var/folders/4f/jnlgcb9n6pg311w43wdsllwc0000gn/T/ipykernel_10584/3572280633.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [37]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [38]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [39]:
data.dropna() # notnull() 인 객체들 반환

0        1
2    hello
dtype: object

In [41]:
df = pd.DataFrame([[1, np.nan, 2],
                  [2,3,5],
                  [np.nan,4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [42]:
df.dropna() # row 전체 삭제됨. data frame 에서는 단일 값 삭제 안됨

     0    1  2
1  2.0  3.0  5

In [44]:
df.dropna(axis='columns') # axis='columns' or axis=1 일 때 행으로 삭제

   2
0  2
1  5
2  6

In [46]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [53]:
print(df)
df.dropna(axis=1, how='all') # how = 'any', 하나라도 있으면 삭제, how = 'all' 다 있어야 삭제 
df.dropna(axis=1, thresh=2) # thresh는 최소 몇 개 이상 있어야 삭제할 지 선정

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [55]:
data = pd.Series([1,np.nan,2,None,3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [58]:
data.fillna(0) # fill = 0 으로 처리 
data.fillna(method='ffill') # ffill = forward fill, 앞 숫자로 fill, bfill은 back fill로 뒤에 오는거로!

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [61]:
print(df)

df.fillna(method='bfill', axis=1) # col 기준으로 옆 컬럼 걸 가져온다고 보면 됨

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  5.0 NaN
2  4.0  4.0  6.0 NaN

## 계층적 인덱스 (hierarchical indexing)

In [63]:
import numpy as np
import pandas as pd

In [65]:
index = [('California', 2000), ('California', 2010),
         ('New York',2000), ('New York', 2010),
         ('Texas', 2000), ('Texas',2010)]
populations = [33871648, 37253956,
              18976457, 19378102,
              20851820, 25145561]

pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [66]:
pop[('California', 2010): ('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [68]:
pop[[i for i in pop.index if i[1] == 2010]] # 이런식으로 munging  그닥 비효율 대용량 처리시.

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

### Pandas Multiindex

In [69]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [70]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [71]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [73]:
pop_df = pop.unstack() # 데이터프레임 전환
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [74]:
pop_df.stack() # unstack과 반대

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [77]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [84]:
f_u18 = pop_df['under18'] / pop_df['total']
print(f_u18, '\n')
print(f_u18.unstack())

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [89]:
df = pd.DataFrame(np.random.rand(4,2),
                  index = [['a','a','b','b'], [1,2,1,2]],
                  columns = ['data1','data2'])
df

pd.MultiIndex.from_arrays([['a','a','b','b'], [1,2,1,2]])
pd.MultiIndex.from_tuples([('a',1),('a',2),('b',1),('b',2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [93]:
pop.index.names = ['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [98]:
pop[['California','Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

### 정렬되어 있지 않은 인덱스

In [99]:
index = pd.MultiIndex.from_product([['a','c','b'], [1,2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char','int']
data

char  int
a     1      0.415588
      2      0.389171
c     1      0.638825
      2      0.995046
b     1      0.694244
      2      0.793305
dtype: float64

In [101]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e) 
    # 에러 먹고 빠져나옴. 왜냐면 위에 data는 인덱스가 a,c,b인데, data['a':'b']는 a,b로 되니까

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [103]:
## 정렬하기

data = data.sort_index()
data

char  int
a     1      0.415588
      2      0.389171
b     1      0.694244
      2      0.793305
c     1      0.638825
      2      0.995046
dtype: float64

In [106]:
data['a':'b']

char  int
a     1      0.415588
      2      0.389171
b     1      0.694244
      2      0.793305
dtype: float64

In [110]:
print(pop, '\n')
print(pop.unstack(),'\n')

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [113]:
## index labeL을 열로 나열

pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [116]:
# 위와 같은 원시 데이터를 multiindex로!

pop_flat.set_index(['state','year']) # state / year 을 index로

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

# Data set 결합 - Concat / Append

In [117]:
import pandas as pd
import numpy as np

In [118]:
def make_df(cols,ind):
    """빠르게 dataframe 생성"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data,ind)

# data_df 예제

make_df('ABC',range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [119]:
x = [1,2,3]
y = [4,5,6]
z = [7,8,9]
np.concatenate([x,y,z]) #np.concatenate

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [120]:
x = [[1,2],
     [3,4]]
np.concatenate([x,x],axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [121]:
ser1 = pd.Series(['A','B','C'], index = [1,2,3])
ser2 = pd.Series(['D','E','F'], index = [4,5,6])
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [127]:
df1 = make_df('AB',[1,2])
df2 = make_df('AB',[3,4])

print(df1, '\n')
print(df2,'\n')
print(pd.concat([df1,df2]))

    A   B
1  A1  B1
2  A2  B2

    A   B
3  A3  B3
4  A4  B4

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

## join 을 이용한 연결

In [129]:
df5 = make_df('ABC',[1,2])
df6 = make_df('BCD',[3,4])
print(df5, '\n')
print(df6, '\n')

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

    B   C   D
3  B3  C3  D3
4  B4  C4  D4

In [132]:
print(pd.concat([df5, df6]))

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [135]:
print(pd.concat([df5,df6],join='inner')) # 교집합만 섞어

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [140]:
# pd.concat([df5,df6]) = df5.append(df6)

print(df1); print(df2); print(df1.append(df2))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

/var/folders/4f/jnlgcb9n6pg311w43wdsllwc0000gn/T/ipykernel_10584/1180077316.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  print(df1); print(df2); print(df1.append(df2))

In [142]:
df1 = pd.DataFrame({'employee': ['Bob','Jake','Lisa','Sue'],
                    'group': ['Accounting','Engineering','Engineering','HR']})
df2 = pd.DataFrame({'employee': ['Lisa','Bob','Jake','Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

print(df1); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [149]:
df_append = df1.append(df2) # 그냥 안섞고 다 붙힘
print(df_append)

  employee        group  hire_date
0      Bob   Accounting        NaN
1     Jake  Engineering        NaN
2     Lisa  Engineering        NaN
3      Sue           HR        NaN
0     Lisa          NaN     2004.0
1      Bob          NaN     2008.0
2     Jake          NaN     2012.0
3      Sue          NaN     2014.0

/var/folders/4f/jnlgcb9n6pg311w43wdsllwc0000gn/T/ipykernel_10584/4240859927.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_append = df1.append(df2)

In [150]:
df3 = pd.merge(df1, df2) #자동으로 열 사용해서 합체!
print(df3)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [154]:
## many to one join (다대일 조인)
df4 = pd.DataFrame({'group' : ['Accounting','Engineering','HR'],
                    'supervisor': ['Carly','Guido','Steve']})

print(df3); print(df4); print(pd.merge(df3, df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [157]:
df5 = pd.DataFrame({'group' : ['Accounting','Accounting','Engineering','Engineering','HR','HR'],
                    'skills': ['math','spreadsheets','coding','linux','spreadsheets','organization']})

print(df1); print(df5); print(pd.merge(df1,df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [159]:
## explicit join (on 사용)

print(df1); print(df2); print(pd.merge(df1,df2, on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [163]:
df3 = pd.DataFrame({'name': ['Bob','Jake','Lisa','Sue'],
                    'salary': [70000,80000,120000,90000]})
print(df1); print(df3); 

pd.merge(df1, df3, left_on='employee', right_on='name')

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [164]:
pd.merge(df1, df3, left_on='employee', right_on='name').drop('name',axis=1) # left/right_on으로 정렬 후 drop으로 중복 삭제

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [165]:
# left/right_index

df1a = df1.set_index('employee')
df2a = df2.set_index('employee')

print(df1a); print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [169]:
print(pd.merge(df1a, df2a, left_index=True, right_index=True)) # join method 로 구현 
# or
print(pd.merge(df1a, df3, left_index=True, right_on='name'))

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000